//Используя хуки useReducer, useEffect, useContext реализовать счётчик
// 1 табло, вывод счётчика (сразу со стартовым текстом), 2 кнопки , увеличить и сбросить
// 2 табло 2 инпута - стартовое значение - максимальное значение. они не должны противоречить друг другу.
// при перезагрузке страницы счётчик должен сохранять своё состояние
// обработать ошибки используя Error boundary
//https://valtikamore.github.io/counter/


// переписать счётчик на mobX

// redux toolkit + redux saga / thunk(createAsyncThunk), tailwind
// фетч тудушек отсюда https://jsonplaceholder.typicode.com/posts
// отрендерить списком посты(тайтлы), по клику на тайтл - открытие модалки, реализованной через портал с бади поста внутри
