//Что такое семантическая вёрстка? Когда использовать тэг article, а когда section?


//Как реализовать разные разрешения картинок?
// к примеру picture1.webp (375px/200px) picture2.webp (1440px/500px) picture3.webp (2200px/800px)  (x1,x2,x3)


// Сверстать email письмо https://www.stampready.net/dashboard/editor-3-5/index.php?demo=iTFh8dXv1PJjMSU4wEVtNQfr76yeOGBa


// Разработать форму - степер , в двух вариациях , используя react-hook-form и formik
// Форма степер должна включать в себя два шага
// Шаг 1 - вопрос с 5-ю вариантами ответа , контролируемый 5-ю кастомными чекбоксами(дизайн на ваш выбор). С кнопкой в низу - следующий вопрос
// Шаг 2 - вопрос с 5-ю вариантами ответа , контролируемый 3-мя кастомными радио кнопками(дизайн на ваш выбор) , вариант ответа один. С кнопкой в низу - сабмит формы

